src/InformationRegisters/onyx_НастройкиAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>onyx_НастройкиAPI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>APIКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймаутСоединения</Name>
					<Comment>Таймаут соединения (секунды)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймаутЧтения</Name>
					<Comment>Таймаут чтения (секунды)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеВремяПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контур</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_КонтурAPI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/onyx_НастройкиAPI/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Публичный программный интерфейс

// Возвращает структуру с настройками API для указанного контура.
// Параметры:
//   Контур - ПеречислениеСсылка.onyx_КонтурAPI - контур API (необязательный).
//            Если не указан, используется значение из константы onyx_ТекущийКонтурAPI.
// Возвращаемое значение:
//   Структура - настройки из регистра сведений "onyx_НастройкиAPI".
Функция ПолучитьНастройки(Контур = Неопределено) Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("БазовыйURL", Неопределено);
	Настройки.Вставить("APIКлюч", Неопределено);
	Настройки.Вставить("ТаймаутСоединения", ТаймаутСоединенияПоУмолчанию());
	Настройки.Вставить("ТаймаутЧтения", ТаймаутЧтенияПоУмолчанию());
	Настройки.Вставить("МаксимальноеКоличествоПовторов", МаксимальноеКоличествоПовторовПоУмолчанию());
	Настройки.Вставить("МаксимальноеВремяПовторов", МаксимальноеВремяПовторовПоУмолчаниюВМинутах());
	Настройки.Вставить("ДатаПоследнегоОбновления", Неопределено);
	
	// Определяем контур для выборки
	Если Не ЗначениеЗаполнено(Контур) Тогда
		Контур = ПолучитьТекущийКонтур();
	КонецЕсли;
	
	// Выборка с отбором по контуру
	Попытка
		Если ЗначениеЗаполнено(Контур) Тогда
			// Используем запрос для выборки с отбором по контуру
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	onyx_НастройкиAPI.БазовыйURL КАК БазовыйURL,
				|	onyx_НастройкиAPI.APIКлюч КАК APIКлюч,
				|	onyx_НастройкиAPI.ТаймаутСоединения КАК ТаймаутСоединения,
				|	onyx_НастройкиAPI.ТаймаутЧтения КАК ТаймаутЧтения,
				|	onyx_НастройкиAPI.МаксимальноеКоличествоПовторов КАК МаксимальноеКоличествоПовторов,
				|	onyx_НастройкиAPI.МаксимальноеВремяПовторов КАК МаксимальноеВремяПовторов,
				|	onyx_НастройкиAPI.ДатаПоследнегоОбновления КАК ДатаПоследнегоОбновления
				|ИЗ
				|	РегистрСведений.onyx_НастройкиAPI КАК onyx_НастройкиAPI
				|ГДЕ
				|	onyx_НастройкиAPI.Контур = &ТекущийКонтур";
			
			Запрос.УстановитьПараметр("ТекущийКонтур", Контур);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				Настройки.БазовыйURL                   = Выборка.БазовыйURL;
				Настройки.APIКлюч                      = Выборка.APIКлюч;
				Настройки.ТаймаутСоединения            = Выборка.ТаймаутСоединения;
				Настройки.ТаймаутЧтения                = Выборка.ТаймаутЧтения;
				Настройки.МаксимальноеКоличествоПовторов = Выборка.МаксимальноеКоличествоПовторов;
				Настройки.МаксимальноеВремяПовторов    = Выборка.МаксимальноеВремяПовторов;
				Настройки.ДатаПоследнегоОбновления     = Выборка.ДатаПоследнегоОбновления;
			КонецЕсли;
		Иначе
			// Если константа не заполнена, используем старый способ
			Выборка = РегистрыСведений.onyx_НастройкиAPI.Выбрать();
			Если Выборка.Следующий() Тогда
				Настройки.БазовыйURL                   = Выборка.БазовыйURL;
				Настройки.APIКлюч                      = Выборка.APIКлюч;
				Настройки.ТаймаутСоединения            = Выборка.ТаймаутСоединения;
				Настройки.ТаймаутЧтения                = Выборка.ТаймаутЧтения;
				Настройки.МаксимальноеКоличествоПовторов = Выборка.МаксимальноеКоличествоПовторов;
				Настройки.МаксимальноеВремяПовторов    = Выборка.МаксимальноеВремяПовторов;
				Настройки.ДатаПоследнегоОбновления     = Выборка.ДатаПоследнегоОбновления;
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Если произошла ошибка (например, константа не заполнена), используем старый способ
		Выборка = РегистрыСведений.onyx_НастройкиAPI.Выбрать();
		Если Выборка.Следующий() Тогда
			Настройки.БазовыйURL                   = Выборка.БазовыйURL;
			Настройки.APIКлюч                      = Выборка.APIКлюч;
			Настройки.ТаймаутСоединения            = Выборка.ТаймаутСоединения;
			Настройки.ТаймаутЧтения                = Выборка.ТаймаутЧтения;
			Настройки.МаксимальноеКоличествоПовторов = Выборка.МаксимальноеКоличествоПовторов;
			Настройки.МаксимальноеВремяПовторов    = Выборка.МаксимальноеВремяПовторов;
			Настройки.ДатаПоследнегоОбновления     = Выборка.ДатаПоследнегоОбновления;
		КонецЕсли;
	КонецПопытки;
	
	Если ПустаяСтрока(Настройки.БазовыйURL) Тогда
		Настройки.БазовыйURL = "https://cloud.onyx.app/api/";
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

// Проверяет наличие настроек API для указанного контура.
// Параметры:
//   Контур - ПеречислениеСсылка.onyx_КонтурAPI - контур API (необязательный).
//            Если не указан, используется значение из константы onyx_ТекущийКонтурAPI.
// Возвращаемое значение:
//   Булево - Истина, если настройки найдены, иначе Ложь.
Функция ПроверитьНаличиеНастроек(Контур = Неопределено) Экспорт
	
	// Определяем контур для проверки
	Если Не ЗначениеЗаполнено(Контур) Тогда
		Контур = ПолучитьТекущийКонтур();
	КонецЕсли;
	
	// Проверяем наличие записей в регистре сведений onyx_НастройкиAPI с отбором по константе
	Попытка
		Если ЗначениеЗаполнено(Контур) Тогда
			// Используем запрос для выборки с отбором по контуру
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	onyx_НастройкиAPI.Контур КАК Контур
				|ИЗ
				|	РегистрСведений.onyx_НастройкиAPI КАК onyx_НастройкиAPI
				|ГДЕ
				|	onyx_НастройкиAPI.Контур = &ТекущийКонтур";
			
			Запрос.УстановитьПараметр("ТекущийКонтур", Контур);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				// Найдена запись для текущего контура
				Возврат Истина;
			Иначе
				// Записей для текущего контура нет
				Возврат Ложь;
			КонецЕсли;
		Иначе
			// Если константа не заполнена, проверяем наличие любых записей
			Выборка = РегистрыСведений.onyx_НастройкиAPI.Выбрать();
			Если Выборка.Следующий() Тогда
				// Найдена хотя бы одна запись
				Возврат Истина;
			Иначе
				// Записей нет
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Если произошла ошибка, используем старый способ
		Выборка = РегистрыСведений.onyx_НастройкиAPI.Выбрать();
		Если Выборка.Следующий() Тогда
			// Найдена хотя бы одна запись
			Возврат Истина;
		Иначе
			// Записей нет
			Возврат Ложь;
		КонецЕсли;
	КонецПопытки;
	
КонецФункции

// Записывает настройки API в регистр сведений.
// Параметры:
//   Настройки - Структура - структура с настройками, должна содержать:
//     Контур - ПеречислениеСсылка.onyx_КонтурAPI (обязательное)
//     APIКлюч - Строка
//     БазовыйURL - Строка
//     ТаймаутСоединения - Число
//     ТаймаутЧтения - Число
//     МаксимальноеКоличествоПовторов - Число
//     МаксимальноеВремяПовторов - Число
// Возвращаемое значение:
//   Структура - результат операции с полями:
//     Успех - Булево
//     ТекстОшибки - Строка
Функция ЗаписатьНастройки(Настройки) Экспорт
	
	Попытка
		
		Если Не ЗначениеЗаполнено(Настройки.Контур) Тогда
			Возврат Новый Структура("Успех,ТекстОшибки", Ложь, "Не указан контур API");
		КонецЕсли;
		
		// Создание набора записей регистра сведений
		НаборЗаписей = РегистрыСведений.onyx_НастройкиAPI.СоздатьНаборЗаписей();
		
		// Установка отбора (если нужно найти существующую запись)
		НаборЗаписей.Отбор.Контур.Установить(Настройки.Контур);
		
		// Очистка набора записей (удаление старых записей с таким контуром)
		НаборЗаписей.Очистить();
		
		// Добавление новой записи в набор
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Контур = Настройки.Контур;
		НоваяЗапись.APIКлюч = Настройки.APIКлюч;
		НоваяЗапись.БазовыйURL = Настройки.БазовыйURL;
		НоваяЗапись.ТаймаутСоединения = Настройки.ТаймаутСоединения;
		НоваяЗапись.ТаймаутЧтения = Настройки.ТаймаутЧтения;
		НоваяЗапись.МаксимальноеКоличествоПовторов = Настройки.МаксимальноеКоличествоПовторов;
		НоваяЗапись.МаксимальноеВремяПовторов = Настройки.МаксимальноеВремяПовторов;
		НоваяЗапись.ДатаПоследнегоОбновления = ТекущаяДатаСеанса();
		
		// Запись набора записей в базу
		НаборЗаписей.Записать();
		
		Возврат Новый Структура("Успех,ТекстОшибки", Истина, "");
		
	Исключение
		
		ТекстОшибки = "Не удалось сохранить настройки: " + ОписаниеОшибки();
		Возврат Новый Структура("Успех,ТекстОшибки", Ложь, ТекстОшибки);
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Частные процедуры и функции

// Возвращает текущий контур API из константы.
// Возвращаемое значение:
//   ПеречислениеСсылка.onyx_КонтурAPI - значение константы или Неопределено.
Функция ПолучитьТекущийКонтур()
	
	Попытка
		Возврат Константы.onyx_ТекущийКонтурAPI.Получить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ТаймаутСоединенияПоУмолчанию()
	
	Возврат 30;
	
КонецФункции

Функция ТаймаутЧтенияПоУмолчанию()
	
	Возврат 60;
	
КонецФункции

Функция МаксимальноеКоличествоПовторовПоУмолчанию()
	
	Возврат 5;
	
КонецФункции

Функция МаксимальноеВремяПовторовПоУмолчаниюВМинутах()
	
	Возврат 10;
	
КонецФункции

#КонецОбласти

#КонецЕсли
